; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star9 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star8 - direction
	Star4 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation10)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star9)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star8)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation10)
)
(:goal (and
	(have_image Planet11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 thermograph2)
	(have_image Star14 thermograph2)
	(have_image Star15 image1)
))

)

; plan
1. (turn_to satellite1 star6 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star6)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 planet11 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet11)
   goals met: 0 of 5
5. (take_image satellite1 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon13 instrument1 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 2 of 5
8. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 2 of 5
9. (take_image satellite1 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 3 of 5
10. (turn_to satellite1 star14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star14)
   goals met: 3 of 5
11. (take_image satellite1 star14 instrument1 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 4 of 5
13. (take_image satellite1 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 5 of 5
